#Область КомандыФормы
&НаКлиенте
Процедура УстановитьАренду(Команда)
	Статус = AzureВызовСервера.УстановитьАрендуAzureFile(
		Объект.СтрокаПодключения,
		Объект.FileName,
		Объект.ShareName,
		Объект.DirectoryPath,
		Объект.ProposedLeaseId
	);

	ВспомогательныйКлиент.ВывестиСтатус(Статус);
	
	Если Статус.Отказ Тогда
		Возврат;	
	КонецЕсли;
	
	Объект.LeaseID = Статус.Ответ.Заголовки.Получить("x-ms-lease-id");	
КонецПроцедуры

&НаКлиенте
Процедура СнятьАренду(Команда)
	Статус = AzureВызовСервера.СнятьАрендуAzureFile(
		Объект.СтрокаПодключения,
		Объект.FileName,
		Объект.ShareName,
		Объект.DirectoryPath,
		Объект.LeaseID
	);

	ВспомогательныйКлиент.ВывестиСтатус(Статус);
КонецПроцедуры

&НаКлиенте
Процедура НовыйGUID(Команда)
	Объект.ProposedLeaseId = Строка(Новый УникальныйИдентификатор());
КонецПроцедуры

&НаКлиенте
Процедура ПрерватьАренду(Команда)
	Статус = AzureВызовСервера.ПрерватьАрендуAzureFile(
		Объект.СтрокаПодключения,
		Объект.FileName,
		Объект.ShareName,
		Объект.DirectoryPath
	);

	ВспомогательныйКлиент.ВывестиСтатус(Статус);
КонецПроцедуры

&НаКлиенте
Процедура СтатусАренды(Команда)
	Статус = AzureВызовСервера.ПолучитьСвойстваФайлаAzureFile(
		Объект.СтрокаПодключения,
		Объект.FileName,
		Объект.ShareName,
		Объект.DirectoryPath
	);
	
	Если НЕ Статус.Отказ Тогда
		СвойстваФайла = Статус.Данные.СвойстваФайла;
		LeaseState =  СвойстваФайла.Получить("x-ms-lease-state");
		LeaseStatus = СвойстваФайла.Получить("x-ms-lease-status");
		Сообщить("LeaseState: " + LeaseState);
		Сообщить("LeaseStatus: " + LeaseStatus);
	КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура ФайлАрендован(Команда)
	Ответ = AzureВызовСервера.ФайлАрендован(
		Объект.СтрокаПодключения,
		Объект.FileName,
		Объект.ShareName,
		Объект.DirectoryPath
	);
	
	Сообщить(Ответ);
КонецПроцедуры
#КонецОбласти 
