Процедура ВывестиСтатус(СтатусОперации) Экспорт
	Если НЕ СтатусОперации.Отказ Тогда
		Сообщить("Операция выполнена успешно");
				
		Для Каждого КлючЗначение Из СтатусОперации.Ответ.Заголовки Цикл
			Сообщить(КлючЗначение.Ключ + " : "  + КлючЗначение.Значение);	
		КонецЦикла; 			
	Иначе
		Сообщить("Код ответа: " + СтатусОперации.Ответ.КодСостояния	);
		Сообщить("Код ошибки: " + СтатусОперации.Ответ.КодОшибки	);		
		Сообщить(СтатусОперации.Ответ.Тело);
		Для каждого Сообщение Из СтатусОперации.Сообщения Цикл
			Сообщить(Сообщение);	
		КонецЦикла; 	
	КонецЕсли; 		
КонецПроцедуры
 