
#Область ОбработкаСобытийФормы
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.МножественныйВыбор = Ложь;
	
	ОП = Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтотОбъект); 
	
	Диалог.Показать(ОП);
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, ДопНастройки) Экспорт
	Если ВыбранныеФайлы <> Неопределено Тогда
		Объект.ПутьКФайлу = ВыбранныеФайлы[0];
	КонецЕсли; 			
КонецПроцедуры


#Область ОбработкаКомандФормы
&НаСервере
Функция СохранитьФайлНаСервере()
	Файл = Новый Файл(Объект.ПутьКФайлу);
	
	МетаТегиСохранить = Новый Структура;
	
	Для каждого МетаТег Из МетаТеги Цикл
		МетаТегиСохранить.Вставить(МетаТег.Тег, МетаТег.Значение);	
	КонецЦикла; 
	
	СтатусОтвет = AzureВызовСервера.СохранитьФайлAzureFile(
		Объект.СтрокаПодключения,
		Новый ДвоичныеДанные(Объект.ПутьКФайлу),
		Файл.Имя,
		Объект.ShareName,
		Объект.DirectoryPath,
		Объект.СохранитьMD5,
		Объект.СоздаватьИерархиюПапок,
		МетаТегиСохранить
	);
	
	Возврат СтатусОтвет;
КонецФункции

&НаКлиенте
Процедура СохранитьФайл(Команда)
	СтатусОтвет = СохранитьФайлНаСервере();
	ВспомогательныйКлиент.ВывестиСтатус(СтатусОтвет);
КонецПроцедуры
#КонецОбласти 

#КонецОбласти 
