
#Область ОбработкаСобытийФормы

&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, ДопНастройки) Экспорт
	Если ВыбранныеФайлы <> Неопределено Тогда
		Объект.ПутьКФайлу = ВыбранныеФайлы[0];
	КонецЕсли; 			
КонецПроцедуры


#Область ОбработкаКомандФормы
&НаСервере
Функция СоздатьПапкуНаСервере()
	
	МетаТегиСохранить = Новый Структура;
	
	Для каждого МетаТег Из Объект.МетаТеги Цикл
		МетаТегиСохранить.Вставить(МетаТег.Тег, МетаТег.Значение);	
	КонецЦикла; 
	
	СтатусОтвет = AzureВызовСервера.СоздатьДиректориюAzureFile(
		Объект.СтрокаПодключения,
		Объект.DirectoryPath,
		Объект.ShareName,
		МетаТегиСохранить
	);
	
	Возврат СтатусОтвет;
КонецФункции

&НаКлиенте
Процедура СоздатьПапку(Команда)
	СтатусОтвет = СоздатьПапкуНаСервере();
	ВспомогательныйКлиент.ВывестиСтатус(СтатусОтвет);
КонецПроцедуры
#КонецОбласти 

#КонецОбласти 
